/**
 *  ueditorÃ¥Â®Å’Ã¦â€¢Â´Ã©â€¦ï¿½Ã§Â½Â®Ã©Â¡Â¹
 *  Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¥Å“Â¨Ã¨Â¿â„¢Ã©â€¡Å’Ã©â€¦ï¿½Ã§Â½Â®Ã¦â€¢Â´Ã¤Â¸ÂªÃ§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã§Å¡â€žÃ§â€°Â¹Ã¦â‚¬Â§
 */
/**************************Ã¦ï¿½ï¿½Ã§Â¤Âº********************************
 * Ã¦â€°â‚¬Ã¦Å“â€°Ã¨Â¢Â«Ã¦Â³Â¨Ã©â€¡Å Ã§Å¡â€žÃ©â€¦ï¿½Ã§Â½Â®Ã©Â¡Â¹Ã¥ï¿½â€¡Ã¤Â¸ÂºUEditorÃ©Â»ËœÃ¨Â®Â¤Ã¥â‚¬Â¼Ã£â‚¬â€š
 * Ã¤Â¿Â®Ã¦â€�Â¹Ã©Â»ËœÃ¨Â®Â¤Ã©â€¦ï¿½Ã§Â½Â®Ã¨Â¯Â·Ã©Â¦â€“Ã¥â€¦Ë†Ã§Â¡Â®Ã¤Â¿ï¿½Ã¥Â·Â²Ã§Â»ï¿½Ã¥Â®Å’Ã¥â€¦Â¨Ã¦ËœÅ½Ã§Â¡Â®Ã¨Â¯Â¥Ã¥ï¿½â€šÃ¦â€¢Â°Ã§Å¡â€žÃ§Å“Å¸Ã¥Â®Å¾Ã§â€�Â¨Ã©â‚¬â€�Ã£â‚¬â€š
 * Ã¤Â¸Â»Ã¨Â¦ï¿½Ã¦Å“â€°Ã¤Â¸Â¤Ã§Â§ï¿½Ã¤Â¿Â®Ã¦â€�Â¹Ã¦â€“Â¹Ã¦Â¡Ë†Ã¯Â¼Å’Ã¤Â¸â‚¬Ã§Â§ï¿½Ã¦ËœÂ¯Ã¥ï¿½â€“Ã¦Â¶Ë†Ã¦Â­Â¤Ã¥Â¤â€žÃ¦Â³Â¨Ã©â€¡Å Ã¯Â¼Å’Ã§â€žÂ¶Ã¥ï¿½Å½Ã¤Â¿Â®Ã¦â€�Â¹Ã¦Ë†ï¿½Ã¥Â¯Â¹Ã¥Âºâ€�Ã¥ï¿½â€šÃ¦â€¢Â°Ã¯Â¼â€ºÃ¥ï¿½Â¦Ã¤Â¸â‚¬Ã§Â§ï¿½Ã¦ËœÂ¯Ã¥Å“Â¨Ã¥Â®Å¾Ã¤Â¾â€¹Ã¥Å’â€“Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¦â€”Â¶Ã¤Â¼Â Ã¥â€¦Â¥Ã¥Â¯Â¹Ã¥Âºâ€�Ã¥ï¿½â€šÃ¦â€¢Â°Ã£â‚¬â€š
 * Ã¥Â½â€œÃ¥ï¿½â€¡Ã§ÂºÂ§Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¦â€”Â¶Ã¯Â¼Å’Ã¥ï¿½Â¯Ã§â€ºÂ´Ã¦Å½Â¥Ã¤Â½Â¿Ã§â€�Â¨Ã¦â€”Â§Ã§â€°Ë†Ã©â€¦ï¿½Ã§Â½Â®Ã¦â€“â€¡Ã¤Â»Â¶Ã¦â€ºÂ¿Ã¦ï¿½Â¢Ã¦â€“Â°Ã§â€°Ë†Ã©â€¦ï¿½Ã§Â½Â®Ã¦â€“â€¡Ã¤Â»Â¶,Ã¤Â¸ï¿½Ã§â€�Â¨Ã¦â€¹â€¦Ã¥Â¿Æ’Ã¦â€”Â§Ã§â€°Ë†Ã©â€¦ï¿½Ã§Â½Â®Ã¦â€“â€¡Ã¤Â»Â¶Ã¤Â¸Â­Ã¥â€ºÂ Ã§Â¼ÂºÃ¥Â°â€˜Ã¦â€“Â°Ã¥Å Å¸Ã¨Æ’Â½Ã¦â€°â‚¬Ã©Å“â‚¬Ã§Å¡â€žÃ¥ï¿½â€šÃ¦â€¢Â°Ã¨â‚¬Å’Ã¥Â¯Â¼Ã¨â€¡Â´Ã¨â€žÅ¡Ã¦Å“Â¬Ã¦Å Â¥Ã©â€�â„¢Ã£â‚¬â€š
 **************************Ã¦ï¿½ï¿½Ã§Â¤Âº********************************/


(function () {
    /**
     * Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¨Âµâ€žÃ¦Âºï¿½Ã¦â€“â€¡Ã¤Â»Â¶Ã¦Â Â¹Ã¨Â·Â¯Ã¥Â¾â€žÃ£â‚¬â€šÃ¥Â®Æ’Ã¦â€°â‚¬Ã¨Â¡Â¨Ã§Â¤ÂºÃ§Å¡â€žÃ¥ï¿½Â«Ã¤Â¹â€°Ã¦ËœÂ¯Ã¯Â¼Å¡Ã¤Â»Â¥Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥Â®Å¾Ã¤Â¾â€¹Ã¥Å’â€“Ã©Â¡ÂµÃ©ï¿½Â¢Ã¤Â¸ÂºÃ¥Â½â€œÃ¥â€°ï¿½Ã¨Â·Â¯Ã¥Â¾â€žÃ¯Â¼Å’Ã¦Å’â€¡Ã¥ï¿½â€˜Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¨Âµâ€žÃ¦Âºï¿½Ã¦â€“â€¡Ã¤Â»Â¶Ã¯Â¼Ë†Ã¥ï¿½Â³dialogÃ§Â­â€°Ã¦â€“â€¡Ã¤Â»Â¶Ã¥Â¤Â¹Ã¯Â¼â€°Ã§Å¡â€žÃ¨Â·Â¯Ã¥Â¾â€žÃ£â‚¬â€š
     * Ã©â€°Â´Ã¤ÂºÅ½Ã¥Â¾Ë†Ã¥Â¤Å¡Ã¥ï¿½Å’Ã¥Â­Â¦Ã¥Å“Â¨Ã¤Â½Â¿Ã§â€�Â¨Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã§Å¡â€žÃ¦â€”Â¶Ã¥â‚¬â„¢Ã¥â€¡ÂºÃ§Å½Â°Ã§Å¡â€žÃ§Â§ï¿½Ã§Â§ï¿½Ã¨Â·Â¯Ã¥Â¾â€žÃ©â€”Â®Ã©Â¢ËœÃ¯Â¼Å’Ã¦Â­Â¤Ã¥Â¤â€žÃ¥Â¼ÂºÃ§Æ’Ë†Ã¥Â»ÂºÃ¨Â®Â®Ã¥Â¤Â§Ã¥Â®Â¶Ã¤Â½Â¿Ã§â€�Â¨"Ã§â€ºÂ¸Ã¥Â¯Â¹Ã¤ÂºÅ½Ã§Â½â€˜Ã§Â«â„¢Ã¦Â Â¹Ã§â€ºÂ®Ã¥Â½â€¢Ã§Å¡â€žÃ§â€ºÂ¸Ã¥Â¯Â¹Ã¨Â·Â¯Ã¥Â¾â€ž"Ã¨Â¿â€ºÃ¨Â¡Å’Ã©â€¦ï¿½Ã§Â½Â®Ã£â‚¬â€š
     * "Ã§â€ºÂ¸Ã¥Â¯Â¹Ã¤ÂºÅ½Ã§Â½â€˜Ã§Â«â„¢Ã¦Â Â¹Ã§â€ºÂ®Ã¥Â½â€¢Ã§Å¡â€žÃ§â€ºÂ¸Ã¥Â¯Â¹Ã¨Â·Â¯Ã¥Â¾â€ž"Ã¤Â¹Å¸Ã¥Â°Â±Ã¦ËœÂ¯Ã¤Â»Â¥Ã¦â€“Å“Ã¦ï¿½Â Ã¥Â¼â‚¬Ã¥Â¤Â´Ã§Å¡â€žÃ¥Â½Â¢Ã¥Â¦â€š"/myProject/ueditor/"Ã¨Â¿â„¢Ã¦Â Â·Ã§Å¡â€žÃ¨Â·Â¯Ã¥Â¾â€žÃ£â‚¬â€š
     * Ã¥Â¦â€šÃ¦Å¾Å“Ã§Â«â„¢Ã§â€šÂ¹Ã¤Â¸Â­Ã¦Å“â€°Ã¥Â¤Å¡Ã¤Â¸ÂªÃ¤Â¸ï¿½Ã¥Å“Â¨Ã¥ï¿½Å’Ã¤Â¸â‚¬Ã¥Â±â€šÃ§ÂºÂ§Ã§Å¡â€žÃ©Â¡ÂµÃ©ï¿½Â¢Ã©Å“â‚¬Ã¨Â¦ï¿½Ã¥Â®Å¾Ã¤Â¾â€¹Ã¥Å’â€“Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¯Â¼Å’Ã¤Â¸â€�Ã¥Â¼â€¢Ã§â€�Â¨Ã¤Âºâ€ Ã¥ï¿½Å’Ã¤Â¸â‚¬UEditorÃ§Å¡â€žÃ¦â€”Â¶Ã¥â‚¬â„¢Ã¯Â¼Å’Ã¦Â­Â¤Ã¥Â¤â€žÃ§Å¡â€žURLÃ¥ï¿½Â¯Ã¨Æ’Â½Ã¤Â¸ï¿½Ã©â‚¬â€šÃ§â€�Â¨Ã¤ÂºÅ½Ã¦Â¯ï¿½Ã¤Â¸ÂªÃ©Â¡ÂµÃ©ï¿½Â¢Ã§Å¡â€žÃ§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã£â‚¬â€š
     * Ã¥â€ºÂ Ã¦Â­Â¤Ã¯Â¼Å’UEditorÃ¦ï¿½ï¿½Ã¤Â¾â€ºÃ¤Âºâ€ Ã©â€™Ë†Ã¥Â¯Â¹Ã¤Â¸ï¿½Ã¥ï¿½Å’Ã©Â¡ÂµÃ©ï¿½Â¢Ã§Å¡â€žÃ§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥ï¿½Â¯Ã¥ï¿½â€¢Ã§â€¹Â¬Ã©â€¦ï¿½Ã§Â½Â®Ã§Å¡â€žÃ¦Â Â¹Ã¨Â·Â¯Ã¥Â¾â€žÃ¯Â¼Å’Ã¥â€¦Â·Ã¤Â½â€œÃ¦ï¿½Â¥Ã¨Â¯Â´Ã¯Â¼Å’Ã¥Å“Â¨Ã©Å“â‚¬Ã¨Â¦ï¿½Ã¥Â®Å¾Ã¤Â¾â€¹Ã¥Å’â€“Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã§Å¡â€žÃ©Â¡ÂµÃ©ï¿½Â¢Ã¦Å“â‚¬Ã©Â¡Â¶Ã©Æ’Â¨Ã¥â€ â„¢Ã¤Â¸Å Ã¥Â¦â€šÃ¤Â¸â€¹Ã¤Â»Â£Ã§Â ï¿½Ã¥ï¿½Â³Ã¥ï¿½Â¯Ã£â‚¬â€šÃ¥Â½â€œÃ§â€žÂ¶Ã¯Â¼Å’Ã©Å“â‚¬Ã¨Â¦ï¿½Ã¤Â»Â¤Ã¦Â­Â¤Ã¥Â¤â€žÃ§Å¡â€žURLÃ§Â­â€°Ã¤ÂºÅ½Ã¥Â¯Â¹Ã¥Âºâ€�Ã§Å¡â€žÃ©â€¦ï¿½Ã§Â½Â®Ã£â‚¬â€š
     * window.UEDITOR_HOME_URL = "/xxxx/xxxx/";
     */
    var URL;

    /**
     * Ã¦Â­Â¤Ã¥Â¤â€žÃ©â€¦ï¿½Ã§Â½Â®Ã¥â€ â„¢Ã¦Â³â€¢Ã©â‚¬â€šÃ§â€�Â¨Ã¤ÂºÅ½UEditorÃ¥Â°ï¿½Ã§Â»â€žÃ¦Ë†ï¿½Ã¥â€˜ËœÃ¥Â¼â‚¬Ã¥ï¿½â€˜Ã¤Â½Â¿Ã§â€�Â¨Ã¯Â¼Å’Ã¥Â¤â€“Ã©Æ’Â¨Ã©Æ’Â¨Ã§Â½Â²Ã§â€�Â¨Ã¦Ë†Â·Ã¨Â¯Â·Ã¦Å’â€°Ã§â€¦Â§Ã¤Â¸Å Ã¨Â¿Â°Ã¨Â¯Â´Ã¦ËœÅ½Ã¦â€“Â¹Ã¥Â¼ï¿½Ã©â€¦ï¿½Ã§Â½Â®Ã¥ï¿½Â³Ã¥ï¿½Â¯Ã¯Â¼Å’Ã¥Â»ÂºÃ¨Â®Â®Ã¤Â¿ï¿½Ã§â€¢â„¢Ã¤Â¸â€¹Ã©ï¿½Â¢Ã¤Â¸Â¤Ã¨Â¡Å’Ã¯Â¼Å’Ã¤Â»Â¥Ã¥â€¦Â¼Ã¥Â®Â¹Ã¥ï¿½Â¯Ã¥Å“Â¨Ã¥â€¦Â·Ã¤Â½â€œÃ¦Â¯ï¿½Ã¤Â¸ÂªÃ©Â¡ÂµÃ©ï¿½Â¢Ã©â€¦ï¿½Ã§Â½Â®window.UEDITOR_HOME_URLÃ§Å¡â€žÃ¥Å Å¸Ã¨Æ’Â½Ã£â‚¬â€š
     */
    var tmp = location.protocol.indexOf("file")==-1 ? location.pathname : location.href;
    URL ="/worm/ueditor/";//Ã¨Â¿â„¢Ã©â€¡Å’Ã¤Â½Â Ã¥ï¿½Â¯Ã¤Â»Â¥Ã©â€¦ï¿½Ã§Â½Â®Ã¦Ë†ï¿½ueditorÃ§â€ºÂ®Ã¥Â½â€¢Ã¥Å“Â¨Ã¦â€šÂ¨Ã§Â½â€˜Ã§Â«â„¢Ã§Å¡â€žÃ§â€ºÂ¸Ã¥Â¯Â¹Ã¨Â·Â¯Ã¥Â¾â€žÃ¦Ë†â€“Ã¨â‚¬â€¦Ã§Â»ï¿½Ã¥Â¯Â¹Ã¨Â·Â¯Ã¥Â¾â€žÃ¯Â¼Ë†Ã¦Å’â€¡Ã¤Â»Â¥httpÃ¥Â¼â‚¬Ã¥Â¤Â´Ã§Å¡â€žÃ§Â»ï¿½Ã¥Â¯Â¹Ã¨Â·Â¯Ã¥Â¾â€žÃ¯Â¼â€°

    /**
     * Ã©â€¦ï¿½Ã§Â½Â®Ã©Â¡Â¹Ã¤Â¸Â»Ã¤Â½â€œÃ£â‚¬â€šÃ¦Â³Â¨Ã¦â€žï¿½Ã¯Â¼Å’Ã¦Â­Â¤Ã¥Â¤â€žÃ¦â€°â‚¬Ã¦Å“â€°Ã¦Â¶â€°Ã¥ï¿½Å Ã¥Ë†Â°Ã¨Â·Â¯Ã¥Â¾â€žÃ§Å¡â€žÃ©â€¦ï¿½Ã§Â½Â®Ã¥Ë†Â«Ã©ï¿½â€”Ã¦Â¼ï¿½URLÃ¥ï¿½ËœÃ©â€¡ï¿½Ã£â‚¬â€š
     */
    window.UEDITOR_CONFIG = {

        //Ã¤Â¸ÂºÃ§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥Â®Å¾Ã¤Â¾â€¹Ã¦Â·Â»Ã¥Å Â Ã¤Â¸â‚¬Ã¤Â¸ÂªÃ¨Â·Â¯Ã¥Â¾â€žÃ¯Â¼Å’Ã¨Â¿â„¢Ã¤Â¸ÂªÃ¤Â¸ï¿½Ã¨Æ’Â½Ã¨Â¢Â«Ã¦Â³Â¨Ã©â€¡Å 
        UEDITOR_HOME_URL : URL

        //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¤Â¸Å Ã¤Â¼Â Ã©â€¦ï¿½Ã§Â½Â®Ã¥Å’Âº
        ,imageUrl:URL+"jsp/imageUp.jsp"             //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¤Â¸Å Ã¤Â¼Â Ã¦ï¿½ï¿½Ã¤ÂºÂ¤Ã¥Å“Â°Ã¥ï¿½â‚¬
        ,imagePath:URL + "jsp/"                     //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¤Â¿Â®Ã¦Â­Â£Ã¥Å“Â°Ã¥ï¿½â‚¬Ã¯Â¼Å’Ã¥Â¼â€¢Ã§â€�Â¨Ã¤Âºâ€ fixedImagePath,Ã¥Â¦â€šÃ¦Å“â€°Ã§â€°Â¹Ã¦Â®Å Ã©Å“â‚¬Ã¦Â±â€šÃ¯Â¼Å’Ã¥ï¿½Â¯Ã¨â€¡ÂªÃ¨Â¡Å’Ã©â€¦ï¿½Ã§Â½Â®
       //,imageFieldName:"upfile"                   //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¦â€¢Â°Ã¦ï¿½Â®Ã§Å¡â€žkey,Ã¨â€¹Â¥Ã¦Â­Â¤Ã¥Â¤â€žÃ¤Â¿Â®Ã¦â€�Â¹Ã¯Â¼Å’Ã©Å“â‚¬Ã¨Â¦ï¿½Ã¥Å“Â¨Ã¥ï¿½Å½Ã¥ï¿½Â°Ã¥Â¯Â¹Ã¥Âºâ€�Ã¦â€“â€¡Ã¤Â»Â¶Ã¤Â¿Â®Ã¦â€�Â¹Ã¥Â¯Â¹Ã¥Âºâ€�Ã¥ï¿½â€šÃ¦â€¢Â°
        //,compressSide:0                            //Ã§Â­â€°Ã¦Â¯â€�Ã¥Å½â€¹Ã§Â¼Â©Ã§Å¡â€žÃ¥Å¸ÂºÃ¥â€¡â€ Ã¯Â¼Å’Ã§Â¡Â®Ã¥Â®Å¡maxImageSideLengthÃ¥ï¿½â€šÃ¦â€¢Â°Ã§Å¡â€žÃ¥ï¿½â€šÃ§â€¦Â§Ã¥Â¯Â¹Ã¨Â±Â¡Ã£â‚¬â€š0Ã¤Â¸ÂºÃ¦Å’â€°Ã§â€¦Â§Ã¦Å“â‚¬Ã©â€¢Â¿Ã¨Â¾Â¹Ã¯Â¼Å’1Ã¤Â¸ÂºÃ¦Å’â€°Ã§â€¦Â§Ã¥Â®Â½Ã¥ÂºÂ¦Ã¯Â¼Å’2Ã¤Â¸ÂºÃ¦Å’â€°Ã§â€¦Â§Ã©Â«ËœÃ¥ÂºÂ¦
        //,maxImageSideLength:900                    //Ã¤Â¸Å Ã¤Â¼Â Ã¥â€ºÂ¾Ã§â€°â€¡Ã¦Å“â‚¬Ã¥Â¤Â§Ã¥â€¦ï¿½Ã¨Â®Â¸Ã§Å¡â€žÃ¨Â¾Â¹Ã©â€¢Â¿Ã¯Â¼Å’Ã¨Â¶â€¦Ã¨Â¿â€¡Ã¤Â¼Å¡Ã¨â€¡ÂªÃ¥Å Â¨Ã§Â­â€°Ã¦Â¯â€�Ã§Â¼Â©Ã¦â€�Â¾,Ã¤Â¸ï¿½Ã§Â¼Â©Ã¦â€�Â¾Ã¥Â°Â±Ã¨Â®Â¾Ã§Â½Â®Ã¤Â¸â‚¬Ã¤Â¸ÂªÃ¦Â¯â€�Ã¨Â¾Æ’Ã¥Â¤Â§Ã§Å¡â€žÃ¥â‚¬Â¼Ã¯Â¼Å’Ã¦â€ºÂ´Ã¥Â¤Å¡Ã¨Â®Â¾Ã§Â½Â®Ã¥Å“Â¨image.htmlÃ¤Â¸Â­

        //Ã¦Â¶â€šÃ©Â¸Â¦Ã¥â€ºÂ¾Ã§â€°â€¡Ã©â€¦ï¿½Ã§Â½Â®Ã¥Å’Âº
        ,scrawlUrl:URL+"jsp/scrawlUp.jsp"           //Ã¦Â¶â€šÃ©Â¸Â¦Ã¤Â¸Å Ã¤Â¼Â Ã¥Å“Â°Ã¥ï¿½â‚¬
        ,scrawlPath:URL+"jsp/"                            //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¤Â¿Â®Ã¦Â­Â£Ã¥Å“Â°Ã¥ï¿½â‚¬Ã¯Â¼Å’Ã¥ï¿½Å’imagePath

        //Ã©â„¢â€žÃ¤Â»Â¶Ã¤Â¸Å Ã¤Â¼Â Ã©â€¦ï¿½Ã§Â½Â®Ã¥Å’Âº
        ,fileUrl:URL+"jsp/fileUp.jsp"               //Ã©â„¢â€žÃ¤Â»Â¶Ã¤Â¸Å Ã¤Â¼Â Ã¦ï¿½ï¿½Ã¤ÂºÂ¤Ã¥Å“Â°Ã¥ï¿½â‚¬
        ,filePath:URL + "jsp/"                   //Ã©â„¢â€žÃ¤Â»Â¶Ã¤Â¿Â®Ã¦Â­Â£Ã¥Å“Â°Ã¥ï¿½â‚¬Ã¯Â¼Å’Ã¥ï¿½Å’imagePath
        //,fileFieldName:"upfile"                    //Ã©â„¢â€žÃ¤Â»Â¶Ã¦ï¿½ï¿½Ã¤ÂºÂ¤Ã§Å¡â€žÃ¨Â¡Â¨Ã¥ï¿½â€¢Ã¥ï¿½ï¿½Ã¯Â¼Å’Ã¨â€¹Â¥Ã¦Â­Â¤Ã¥Â¤â€žÃ¤Â¿Â®Ã¦â€�Â¹Ã¯Â¼Å’Ã©Å“â‚¬Ã¨Â¦ï¿½Ã¥Å“Â¨Ã¥ï¿½Å½Ã¥ï¿½Â°Ã¥Â¯Â¹Ã¥Âºâ€�Ã¦â€“â€¡Ã¤Â»Â¶Ã¤Â¿Â®Ã¦â€�Â¹Ã¥Â¯Â¹Ã¥Âºâ€�Ã¥ï¿½â€šÃ¦â€¢Â°

         //Ã¨Â¿Å“Ã§Â¨â€¹Ã¦Å â€œÃ¥ï¿½â€“Ã©â€¦ï¿½Ã§Â½Â®Ã¥Å’Âº
        //,catchRemoteImageEnable:true               //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¥Â¼â‚¬Ã¥ï¿½Â¯Ã¨Â¿Å“Ã§Â¨â€¹Ã¥â€ºÂ¾Ã§â€°â€¡Ã¦Å â€œÃ¥ï¿½â€“,Ã©Â»ËœÃ¨Â®Â¤Ã¥Â¼â‚¬Ã¥ï¿½Â¯
        ,catcherUrl:URL +"jsp/getRemoteImage.jsp"   //Ã¥Â¤â€žÃ§ï¿½â€ Ã¨Â¿Å“Ã§Â¨â€¹Ã¥â€ºÂ¾Ã§â€°â€¡Ã¦Å â€œÃ¥ï¿½â€“Ã§Å¡â€žÃ¥Å“Â°Ã¥ï¿½â‚¬
        ,catcherPath:URL + "jsp/"                  //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¤Â¿Â®Ã¦Â­Â£Ã¥Å“Â°Ã¥ï¿½â‚¬Ã¯Â¼Å’Ã¥ï¿½Å’imagePath
        //,catchFieldName:"upfile"                   //Ã¦ï¿½ï¿½Ã¤ÂºÂ¤Ã¥Ë†Â°Ã¥ï¿½Å½Ã¥ï¿½Â°Ã¨Â¿Å“Ã§Â¨â€¹Ã¥â€ºÂ¾Ã§â€°â€¡uriÃ¥ï¿½Ë†Ã©â€ºâ€ Ã¯Â¼Å’Ã¨â€¹Â¥Ã¦Â­Â¤Ã¥Â¤â€žÃ¤Â¿Â®Ã¦â€�Â¹Ã¯Â¼Å’Ã©Å“â‚¬Ã¨Â¦ï¿½Ã¥Å“Â¨Ã¥ï¿½Å½Ã¥ï¿½Â°Ã¥Â¯Â¹Ã¥Âºâ€�Ã¦â€“â€¡Ã¤Â»Â¶Ã¤Â¿Â®Ã¦â€�Â¹Ã¥Â¯Â¹Ã¥Âºâ€�Ã¥ï¿½â€šÃ¦â€¢Â°
        //,separater:'ue_separate_ue'               //Ã¦ï¿½ï¿½Ã¤ÂºÂ¤Ã¨â€¡Â³Ã¥ï¿½Å½Ã¥ï¿½Â°Ã§Å¡â€žÃ¨Â¿Å“Ã§Â¨â€¹Ã¥â€ºÂ¾Ã§â€°â€¡Ã¥Å“Â°Ã¥ï¿½â‚¬Ã¥Â­â€”Ã§Â¬Â¦Ã¤Â¸Â²Ã¥Ë†â€ Ã©Å¡â€�Ã§Â¬Â¦
        //,localDomain:[]                            //Ã¦Å“Â¬Ã¥Å“Â°Ã©Â¡Â¶Ã§ÂºÂ§Ã¥Å¸Å¸Ã¥ï¿½ï¿½Ã¯Â¼Å’Ã¥Â½â€œÃ¥Â¼â‚¬Ã¥ï¿½Â¯Ã¨Â¿Å“Ã§Â¨â€¹Ã¥â€ºÂ¾Ã§â€°â€¡Ã¦Å â€œÃ¥ï¿½â€“Ã¦â€”Â¶Ã¯Â¼Å’Ã©â„¢Â¤Ã¦Â­Â¤Ã¤Â¹â€¹Ã¥Â¤â€“Ã§Å¡â€žÃ¦â€°â‚¬Ã¦Å“â€°Ã¥â€¦Â¶Ã¥Â®Æ’Ã¥Å¸Å¸Ã¥ï¿½ï¿½Ã¤Â¸â€¹Ã§Å¡â€žÃ¥â€ºÂ¾Ã§â€°â€¡Ã©Æ’Â½Ã¥Â°â€ Ã¨Â¢Â«Ã¦Å â€œÃ¥ï¿½â€“Ã¥Ë†Â°Ã¦Å“Â¬Ã¥Å“Â°,Ã©Â»ËœÃ¨Â®Â¤Ã¤Â¸ï¿½Ã¦Å â€œÃ¥ï¿½â€“127.0.0.1Ã¥â€™Å’localhost

        //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¥Å“Â¨Ã§ÂºÂ¿Ã§Â®Â¡Ã§ï¿½â€ Ã©â€¦ï¿½Ã§Â½Â®Ã¥Å’Âº
        ,imageManagerUrl:URL + "jsp/imageManager.jsp"       //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¥Å“Â¨Ã§ÂºÂ¿Ã§Â®Â¡Ã§ï¿½â€ Ã§Å¡â€žÃ¥Â¤â€žÃ§ï¿½â€ Ã¥Å“Â°Ã¥ï¿½â‚¬
        ,imageManagerPath:URL + "jsp/"                                    //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¤Â¿Â®Ã¦Â­Â£Ã¥Å“Â°Ã¥ï¿½â‚¬Ã¯Â¼Å’Ã¥ï¿½Å’imagePath

        //Ã¥Â±ï¿½Ã¥Â¹â€¢Ã¦Ë†ÂªÃ¥â€ºÂ¾Ã©â€¦ï¿½Ã§Â½Â®Ã¥Å’Âº
        ,snapscreenHost: '127.0.0.1'                                  //Ã¥Â±ï¿½Ã¥Â¹â€¢Ã¦Ë†ÂªÃ¥â€ºÂ¾Ã§Å¡â€žserverÃ§Â«Â¯Ã¦â€“â€¡Ã¤Â»Â¶Ã¦â€°â‚¬Ã¥Å“Â¨Ã§Å¡â€žÃ§Â½â€˜Ã§Â«â„¢Ã¥Å“Â°Ã¥ï¿½â‚¬Ã¦Ë†â€“Ã¨â‚¬â€¦ipÃ¯Â¼Å’Ã¨Â¯Â·Ã¤Â¸ï¿½Ã¨Â¦ï¿½Ã¥Å Â http://
        ,snapscreenServerUrl: URL +"jsp/imageUp.jsp" //Ã¥Â±ï¿½Ã¥Â¹â€¢Ã¦Ë†ÂªÃ¥â€ºÂ¾Ã§Å¡â€žserverÃ§Â«Â¯Ã¤Â¿ï¿½Ã¥Â­ËœÃ§Â¨â€¹Ã¥Âºï¿½Ã¯Â¼Å’UEditorÃ§Å¡â€žÃ¨Å’Æ’Ã¤Â¾â€¹Ã¤Â»Â£Ã§Â ï¿½Ã¤Â¸ÂºÃ¢â‚¬Å“URL +"server/upload/jsp/snapImgUp.jsp"Ã¢â‚¬ï¿½
        ,snapscreenPath: URL + "jsp/"
        //,snapscreenServerPort: 80                                    //Ã¥Â±ï¿½Ã¥Â¹â€¢Ã¦Ë†ÂªÃ¥â€ºÂ¾Ã§Å¡â€žserverÃ§Â«Â¯Ã§Â«Â¯Ã¥ï¿½Â£
        //,snapscreenImgAlign: 'center'                                //Ã¦Ë†ÂªÃ¥â€ºÂ¾Ã§Å¡â€žÃ¥â€ºÂ¾Ã§â€°â€¡Ã©Â»ËœÃ¨Â®Â¤Ã§Å¡â€žÃ¦Å½â€™Ã§â€°Ë†Ã¦â€“Â¹Ã¥Â¼ï¿½

        //wordÃ¨Â½Â¬Ã¥Â­ËœÃ©â€¦ï¿½Ã§Â½Â®Ã¥Å’Âº
        ,wordImageUrl:URL + "jsp/imageUp.jsp"             //wordÃ¨Â½Â¬Ã¥Â­ËœÃ¦ï¿½ï¿½Ã¤ÂºÂ¤Ã¥Å“Â°Ã¥ï¿½â‚¬
        ,wordImagePath:URL + "jsp/"                       //
        //,wordImageFieldName:"upfile"                     //wordÃ¨Â½Â¬Ã¥Â­ËœÃ¨Â¡Â¨Ã¥ï¿½â€¢Ã¥ï¿½ï¿½Ã¨â€¹Â¥Ã¦Â­Â¤Ã¥Â¤â€žÃ¤Â¿Â®Ã¦â€�Â¹Ã¯Â¼Å’Ã©Å“â‚¬Ã¨Â¦ï¿½Ã¥Å“Â¨Ã¥ï¿½Å½Ã¥ï¿½Â°Ã¥Â¯Â¹Ã¥Âºâ€�Ã¦â€“â€¡Ã¤Â»Â¶Ã¤Â¿Â®Ã¦â€�Â¹Ã¥Â¯Â¹Ã¥Âºâ€�Ã¥ï¿½â€šÃ¦â€¢Â°

        //Ã¨Å½Â·Ã¥ï¿½â€“Ã¨Â§â€ Ã©Â¢â€˜Ã¦â€¢Â°Ã¦ï¿½Â®Ã§Å¡â€žÃ¥Å“Â°Ã¥ï¿½â‚¬
        ,getMovieUrl:URL+"jsp/getMovie.jsp"                   //Ã¨Â§â€ Ã©Â¢â€˜Ã¦â€¢Â°Ã¦ï¿½Â®Ã¨Å½Â·Ã¥ï¿½â€“Ã¥Å“Â°Ã¥ï¿½â‚¬

        //Ã¥Â·Â¥Ã¥â€¦Â·Ã¦Â ï¿½Ã¤Â¸Å Ã§Å¡â€žÃ¦â€°â‚¬Ã¦Å“â€°Ã§Å¡â€žÃ¥Å Å¸Ã¨Æ’Â½Ã¦Å’â€°Ã©â€™Â®Ã¥â€™Å’Ã¤Â¸â€¹Ã¦â€¹â€°Ã¦Â¡â€ Ã¯Â¼Å’Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¥Å“Â¨newÃ§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã§Å¡â€žÃ¥Â®Å¾Ã¤Â¾â€¹Ã¦â€”Â¶Ã©â‚¬â€°Ã¦â€¹Â©Ã¨â€¡ÂªÃ¥Â·Â±Ã©Å“â‚¬Ã¨Â¦ï¿½Ã§Å¡â€žÃ¤Â»Å½Ã¦â€“Â°Ã¥Â®Å¡Ã¤Â¹â€°
        ,toolbars:[
            ['fullscreen', 'source', '|', 'undo', 'redo', '|',
                'bold', 'italic', 'underline', 'strikethrough', 'superscript', 'subscript', 'removeformat', 'formatmatch','autotypeset','blockquote', 'pasteplain', '|', 'forecolor', 'backcolor', 'insertorderedlist', 'insertunorderedlist','selectall', 'cleardoc', '|',
                'rowspacingtop', 'rowspacingbottom','lineheight','|',
                'customstyle', 'paragraph', 'fontfamily', 'fontsize', '|',
                'directionalityltr', 'directionalityrtl', 'indent', '|',
                'justifyleft', 'justifycenter', 'justifyright', 'justifyjustify', '|','touppercase','tolowercase','|',
                'link', 'unlink', 'anchor', '|', 'imagenone', 'imageleft', 'imageright','imagecenter', '|',
                'insertimage', 'emotion','scrawl', 'insertvideo','music','attachment', 'map', 'gmap', 'insertframe','highlightcode','webapp','pagebreak','template','background', '|',
                'horizontal', 'date', 'time', 'spechars','snapscreen', 'wordimage', '|',
                'inserttable', 'deletetable', 'insertparagraphbeforetable', 'insertrow', 'deleterow', 'insertcol', 'deletecol', 'mergecells', 'mergeright', 'mergedown', 'splittocells', 'splittorows', 'splittocols', '|',
                'print', 'preview', 'searchreplace','help']
        ]
        //Ã¥Â½â€œÃ©Â¼Â Ã¦Â â€¡Ã¦â€�Â¾Ã¥Å“Â¨Ã¥Â·Â¥Ã¥â€¦Â·Ã¦Â ï¿½Ã¤Â¸Å Ã¦â€”Â¶Ã¦ËœÂ¾Ã§Â¤ÂºÃ§Å¡â€žtooltipÃ¦ï¿½ï¿½Ã§Â¤Âº,Ã§â€¢â„¢Ã§Â©ÂºÃ¦â€�Â¯Ã¦Å’ï¿½Ã¨â€¡ÂªÃ¥Å Â¨Ã¥Â¤Å¡Ã¨Â¯Â­Ã¨Â¨â‚¬Ã©â€¦ï¿½Ã§Â½Â®Ã¯Â¼Å’Ã¥ï¿½Â¦Ã¥Ë†â„¢Ã¤Â»Â¥Ã©â€¦ï¿½Ã§Â½Â®Ã¥â‚¬Â¼Ã¤Â¸ÂºÃ¥â€¡â€ 
        ,labelMap:{
            'anchor':'', 'undo':''
        }
        //webAppKey
        //Ã§â„¢Â¾Ã¥ÂºÂ¦Ã¥Âºâ€�Ã§â€�Â¨Ã§Å¡â€žAPIkeyÃ¯Â¼Å’Ã¦Â¯ï¿½Ã¤Â¸ÂªÃ§Â«â„¢Ã©â€¢Â¿Ã¥Â¿â€¦Ã©Â¡Â»Ã©Â¦â€“Ã¥â€¦Ë†Ã¥Å½Â»Ã§â„¢Â¾Ã¥ÂºÂ¦Ã¥Â®ËœÃ§Â½â€˜Ã¦Â³Â¨Ã¥â€ Å’Ã¤Â¸â‚¬Ã¤Â¸ÂªkeyÃ¥ï¿½Å½Ã¦â€“Â¹Ã¨Æ’Â½Ã¦Â­Â£Ã¥Â¸Â¸Ã¤Â½Â¿Ã§â€�Â¨appÃ¥Å Å¸Ã¨Æ’Â½
        ,webAppKey:""

        //Ã¨Â¯Â­Ã¨Â¨â‚¬Ã©â€¦ï¿½Ã§Â½Â®Ã©Â¡Â¹,Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯zh-cnÃ£â‚¬â€šÃ¦Å“â€°Ã©Å“â‚¬Ã¨Â¦ï¿½Ã§Å¡â€žÃ¨Â¯ï¿½Ã¤Â¹Å¸Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¤Â½Â¿Ã§â€�Â¨Ã¥Â¦â€šÃ¤Â¸â€¹Ã¨Â¿â„¢Ã¦Â Â·Ã§Å¡â€žÃ¦â€“Â¹Ã¥Â¼ï¿½Ã¦ï¿½Â¥Ã¨â€¡ÂªÃ¥Å Â¨Ã¥Â¤Å¡Ã¨Â¯Â­Ã¨Â¨â‚¬Ã¥Ë†â€¡Ã¦ï¿½Â¢Ã¯Â¼Å’Ã¥Â½â€œÃ§â€žÂ¶Ã¯Â¼Å’Ã¥â€°ï¿½Ã¦ï¿½ï¿½Ã¦ï¿½Â¡Ã¤Â»Â¶Ã¦ËœÂ¯langÃ¦â€“â€¡Ã¤Â»Â¶Ã¥Â¤Â¹Ã¤Â¸â€¹Ã¥Â­ËœÃ¥Å“Â¨Ã¥Â¯Â¹Ã¥Âºâ€�Ã§Å¡â€žÃ¨Â¯Â­Ã¨Â¨â‚¬Ã¦â€“â€¡Ã¤Â»Â¶Ã¯Â¼Å¡
        //langÃ¥â‚¬Â¼Ã¤Â¹Å¸Ã¥ï¿½Â¯Ã¤Â»Â¥Ã©â‚¬Å¡Ã¨Â¿â€¡Ã¨â€¡ÂªÃ¥Å Â¨Ã¨Å½Â·Ã¥ï¿½â€“ (navigator.language||navigator.browserLanguage ||navigator.userLanguage).toLowerCase()
        //,lang:"zh-cn"
        //,langPath:URL +"lang/"

        //Ã¤Â¸Â»Ã©Â¢ËœÃ©â€¦ï¿½Ã§Â½Â®Ã©Â¡Â¹,Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯defaultÃ£â‚¬â€šÃ¦Å“â€°Ã©Å“â‚¬Ã¨Â¦ï¿½Ã§Å¡â€žÃ¨Â¯ï¿½Ã¤Â¹Å¸Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¤Â½Â¿Ã§â€�Â¨Ã¥Â¦â€šÃ¤Â¸â€¹Ã¨Â¿â„¢Ã¦Â Â·Ã§Å¡â€žÃ¦â€“Â¹Ã¥Â¼ï¿½Ã¦ï¿½Â¥Ã¨â€¡ÂªÃ¥Å Â¨Ã¥Â¤Å¡Ã¤Â¸Â»Ã©Â¢ËœÃ¥Ë†â€¡Ã¦ï¿½Â¢Ã¯Â¼Å’Ã¥Â½â€œÃ§â€žÂ¶Ã¯Â¼Å’Ã¥â€°ï¿½Ã¦ï¿½ï¿½Ã¦ï¿½Â¡Ã¤Â»Â¶Ã¦ËœÂ¯themesÃ¦â€“â€¡Ã¤Â»Â¶Ã¥Â¤Â¹Ã¤Â¸â€¹Ã¥Â­ËœÃ¥Å“Â¨Ã¥Â¯Â¹Ã¥Âºâ€�Ã§Å¡â€žÃ¤Â¸Â»Ã©Â¢ËœÃ¦â€“â€¡Ã¤Â»Â¶Ã¯Â¼Å¡
        //Ã§Å½Â°Ã¦Å“â€°Ã¥Â¦â€šÃ¤Â¸â€¹Ã§Å¡Â®Ã¨â€šÂ¤:default,modern,gorgeous
        //,theme:'default'
        //,themePath:URL +"themes/"

        //Ã¨â€¹Â¥Ã¥Â®Å¾Ã¤Â¾â€¹Ã¥Å’â€“Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã§Å¡â€žÃ©Â¡ÂµÃ©ï¿½Â¢Ã¦â€°â€¹Ã¥Å Â¨Ã¤Â¿Â®Ã¦â€�Â¹Ã§Å¡â€ždomainÃ¯Â¼Å’Ã¦Â­Â¤Ã¥Â¤â€žÃ©Å“â‚¬Ã¨Â¦ï¿½Ã¨Â®Â¾Ã§Â½Â®Ã¤Â¸Âºtrue
        //,customDomain:false

        //Ã©â€™Ë†Ã¥Â¯Â¹getAllHtmlÃ¦â€“Â¹Ã¦Â³â€¢Ã¯Â¼Å’Ã¤Â¼Å¡Ã¥Å“Â¨Ã¥Â¯Â¹Ã¥Âºâ€�Ã§Å¡â€žheadÃ¦Â â€¡Ã§Â­Â¾Ã¤Â¸Â­Ã¥Â¢Å¾Ã¥Å Â Ã¨Â¯Â¥Ã§Â¼â€“Ã§Â ï¿½Ã¨Â®Â¾Ã§Â½Â®Ã£â‚¬â€š
        //,charset:"utf-8"

        //Ã¥Â¸Â¸Ã§â€�Â¨Ã©â€¦ï¿½Ã§Â½Â®Ã©Â¡Â¹Ã§â€ºÂ®
        //,isShow : true    //Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¾Ã§Â¤ÂºÃ§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨

        //,initialContent:'Ã¦Â¬Â¢Ã¨Â¿Å½Ã¤Â½Â¿Ã§â€�Â¨ueditor!'    //Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥Å’â€“Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã§Å¡â€žÃ¥â€ â€¦Ã¥Â®Â¹,Ã¤Â¹Å¸Ã¥ï¿½Â¯Ã¤Â»Â¥Ã©â‚¬Å¡Ã¨Â¿â€¡textarea/scriptÃ§Â»â„¢Ã¥â‚¬Â¼Ã¯Â¼Å’Ã§Å“â€¹Ã¥Â®ËœÃ§Â½â€˜Ã¤Â¾â€¹Ã¥Â­ï¿½

        //,initialFrameWidth:1000  //Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥Å’â€“Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥Â®Â½Ã¥ÂºÂ¦,Ã©Â»ËœÃ¨Â®Â¤1000
        //,initialFrameHeight:320  //Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥Å’â€“Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã©Â«ËœÃ¥ÂºÂ¦,Ã©Â»ËœÃ¨Â®Â¤320

        //,autoClearinitialContent:true //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¨â€¡ÂªÃ¥Å Â¨Ã¦Â¸â€¦Ã©â„¢Â¤Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥â€ â€¦Ã¥Â®Â¹Ã¯Â¼Å’Ã¦Â³Â¨Ã¦â€žï¿½Ã¯Â¼Å¡Ã¥Â¦â€šÃ¦Å¾Å“focusÃ¥Â±Å¾Ã¦â‚¬Â§Ã¨Â®Â¾Ã§Â½Â®Ã¤Â¸Âºtrue,Ã¨Â¿â„¢Ã¤Â¸ÂªÃ¤Â¹Å¸Ã¤Â¸ÂºÃ§Å“Å¸Ã¯Â¼Å’Ã©â€šÂ£Ã¤Â¹Ë†Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¤Â¸â‚¬Ã¤Â¸Å Ã¦ï¿½Â¥Ã¥Â°Â±Ã¤Â¼Å¡Ã¨Â§Â¦Ã¥ï¿½â€˜Ã¥Â¯Â¼Ã¨â€¡Â´Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥Å’â€“Ã§Å¡â€žÃ¥â€ â€¦Ã¥Â®Â¹Ã§Å“â€¹Ã¤Â¸ï¿½Ã¥Ë†Â°Ã¤Âºâ€ 

        //,iframeCssUrl: URL + '/themes/iframe.css' //Ã§Â»â„¢Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥â€ â€¦Ã©Æ’Â¨Ã¥Â¼â€¢Ã¥â€¦Â¥Ã¤Â¸â‚¬Ã¤Â¸ÂªcssÃ¦â€“â€¡Ã¤Â»Â¶

        //,textarea:'editorValue' // Ã¦ï¿½ï¿½Ã¤ÂºÂ¤Ã¨Â¡Â¨Ã¥ï¿½â€¢Ã¦â€”Â¶Ã¯Â¼Å’Ã¦Å“ï¿½Ã¥Å Â¡Ã¥â„¢Â¨Ã¨Å½Â·Ã¥ï¿½â€“Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¦ï¿½ï¿½Ã¤ÂºÂ¤Ã¥â€ â€¦Ã¥Â®Â¹Ã§Å¡â€žÃ¦â€°â‚¬Ã§â€�Â¨Ã§Å¡â€žÃ¥ï¿½â€šÃ¦â€¢Â°Ã¯Â¼Å’Ã¥Â¤Å¡Ã¥Â®Å¾Ã¤Â¾â€¹Ã¦â€”Â¶Ã¥ï¿½Â¯Ã¤Â»Â¥Ã§Â»â„¢Ã¥Â®Â¹Ã¥â„¢Â¨nameÃ¥Â±Å¾Ã¦â‚¬Â§Ã¯Â¼Å’Ã¤Â¼Å¡Ã¥Â°â€ nameÃ§Â»â„¢Ã¥Â®Å¡Ã§Å¡â€žÃ¥â‚¬Â¼Ã¦Å“â‚¬Ã¤Â¸ÂºÃ¦Â¯ï¿½Ã¤Â¸ÂªÃ¥Â®Å¾Ã¤Â¾â€¹Ã§Å¡â€žÃ©â€�Â®Ã¥â‚¬Â¼Ã¯Â¼Å’Ã¤Â¸ï¿½Ã§â€�Â¨Ã¦Â¯ï¿½Ã¦Â¬Â¡Ã¥Â®Å¾Ã¤Â¾â€¹Ã¥Å’â€“Ã§Å¡â€žÃ¦â€”Â¶Ã¥â‚¬â„¢Ã©Æ’Â½Ã¨Â®Â¾Ã§Â½Â®Ã¨Â¿â„¢Ã¤Â¸ÂªÃ¥â‚¬Â¼

        //,focus:false //Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥Å’â€“Ã¦â€”Â¶Ã¯Â¼Å’Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¨Â®Â©Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¨Å½Â·Ã¥Â¾â€”Ã§â€žÂ¦Ã§â€šÂ¹trueÃ¦Ë†â€“false

        //,autoClearEmptyNode : true //getContentÃ¦â€”Â¶Ã¯Â¼Å’Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¥Ë†Â Ã©â„¢Â¤Ã§Â©ÂºÃ§Å¡â€žinlineElementÃ¨Å â€šÃ§â€šÂ¹Ã¯Â¼Ë†Ã¥Å’â€¦Ã¦â€¹Â¬Ã¥ÂµÅ’Ã¥Â¥â€”Ã§Å¡â€žÃ¦Æ’â€¦Ã¥â€ ÂµÃ¯Â¼â€°

        //,fullscreen : false //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¥Â¼â‚¬Ã¥ï¿½Â¯Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥Å’â€“Ã¦â€”Â¶Ã¥ï¿½Â³Ã¥â€¦Â¨Ã¥Â±ï¿½Ã¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¥â€¦Â³Ã©â€”Â­

        //,readonly : false /Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥Å’â€“Ã§Â»â€œÃ¦ï¿½Å¸Ã¥ï¿½Å½,Ã§Â¼â€“Ã¨Â¾â€˜Ã¥Å’ÂºÃ¥Å¸Å¸Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¦ËœÂ¯Ã¥ï¿½ÂªÃ¨Â¯Â»Ã§Å¡â€žÃ¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯false

        //,zIndex : 900     //Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥Â±â€šÃ§ÂºÂ§Ã§Å¡â€žÃ¥Å¸ÂºÃ¦â€¢Â°,Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯900

        //,imagePopup:true      //Ã¥â€ºÂ¾Ã§â€°â€¡Ã¦â€œï¿½Ã¤Â½Å“Ã§Å¡â€žÃ¦ÂµÂ®Ã¥Â±â€šÃ¥Â¼â‚¬Ã¥â€¦Â³Ã¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¦â€°â€œÃ¥Â¼â‚¬

        //,initialStyle:'body{font-size:18px}'   //Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥â€ â€¦Ã©Æ’Â¨Ã¦Â Â·Ã¥Â¼ï¿½,Ã¥ï¿½Â¯Ã¤Â»Â¥Ã§â€�Â¨Ã¦ï¿½Â¥Ã¦â€�Â¹Ã¥ï¿½ËœÃ¥Â­â€”Ã¤Â½â€œÃ§Â­â€°

        //,emotionLocalization:false //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¥Â¼â‚¬Ã¥ï¿½Â¯Ã¨Â¡Â¨Ã¦Æ’â€¦Ã¦Å“Â¬Ã¥Å“Â°Ã¥Å’â€“Ã¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¥â€¦Â³Ã©â€”Â­Ã£â‚¬â€šÃ¨â€¹Â¥Ã¨Â¦ï¿½Ã¥Â¼â‚¬Ã¥ï¿½Â¯Ã¨Â¯Â·Ã§Â¡Â®Ã¤Â¿ï¿½emotionÃ¦â€“â€¡Ã¤Â»Â¶Ã¥Â¤Â¹Ã¤Â¸â€¹Ã¥Å’â€¦Ã¥ï¿½Â«Ã¥Â®ËœÃ§Â½â€˜Ã¦ï¿½ï¿½Ã¤Â¾â€ºÃ§Å¡â€žimagesÃ¨Â¡Â¨Ã¦Æ’â€¦Ã¦â€“â€¡Ã¤Â»Â¶Ã¥Â¤Â¹

        //,pasteplain:false  //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã§ÂºÂ¯Ã¦â€“â€¡Ã¦Å“Â¬Ã§Â²ËœÃ¨Â´Â´Ã£â‚¬â€šfalseÃ¤Â¸ÂºÃ¤Â¸ï¿½Ã¤Â½Â¿Ã§â€�Â¨Ã§ÂºÂ¯Ã¦â€“â€¡Ã¦Å“Â¬Ã§Â²ËœÃ¨Â´Â´Ã¯Â¼Å’trueÃ¤Â¸ÂºÃ¤Â½Â¿Ã§â€�Â¨Ã§ÂºÂ¯Ã¦â€“â€¡Ã¦Å“Â¬Ã§Â²ËœÃ¨Â´Â´

        //,allHtmlEnabled:false //Ã¦ï¿½ï¿½Ã¤ÂºÂ¤Ã¥Ë†Â°Ã¥ï¿½Å½Ã¥ï¿½Â°Ã§Å¡â€žÃ¦â€¢Â°Ã¦ï¿½Â®Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¥Å’â€¦Ã¥ï¿½Â«Ã¦â€¢Â´Ã¤Â¸ÂªhtmlÃ¥Â­â€”Ã§Â¬Â¦Ã¤Â¸Â²
        //iframeUrlMap
        //dialogÃ¥â€ â€¦Ã¥Â®Â¹Ã§Å¡â€žÃ¨Â·Â¯Ã¥Â¾â€ž Ã¯Â½Å¾Ã¤Â¼Å¡Ã¨Â¢Â«Ã¦â€ºÂ¿Ã¦ï¿½Â¢Ã¦Ë†ï¿½URL,Ã¥Å¾â€œÃ¥Â±Å¾Ã¦â‚¬Â§Ã¤Â¸â‚¬Ã¦â€”Â¦Ã¦â€°â€œÃ¥Â¼â‚¬Ã¯Â¼Å’Ã¥Â°â€ Ã¨Â¦â€ Ã§â€ºâ€“Ã¦â€°â‚¬Ã¦Å“â€°Ã§Å¡â€ždialogÃ§Å¡â€žÃ©Â»ËœÃ¨Â®Â¤Ã¨Â·Â¯Ã¥Â¾â€ž
        //,iframeUrlMap:{
        // 'anchor':'~/dialogs/anchor/anchor.html',
        // }

        //insertorderedlist
        //Ã¦Å“â€°Ã¥Âºï¿½Ã¥Ë†â€”Ã¨Â¡Â¨Ã§Å¡â€žÃ¤Â¸â€¹Ã¦â€¹â€°Ã©â€¦ï¿½Ã§Â½Â®,Ã¥â‚¬Â¼Ã§â€¢â„¢Ã§Â©ÂºÃ¦â€”Â¶Ã¦â€�Â¯Ã¦Å’ï¿½Ã¥Â¤Å¡Ã¨Â¯Â­Ã¨Â¨â‚¬Ã¨â€¡ÂªÃ¥Å Â¨Ã¨Â¯â€ Ã¥Ë†Â«Ã¯Â¼Å’Ã¨â€¹Â¥Ã©â€¦ï¿½Ã§Â½Â®Ã¥â‚¬Â¼Ã¯Â¼Å’Ã¥Ë†â„¢Ã¤Â»Â¥Ã¦Â­Â¤Ã¥â‚¬Â¼Ã¤Â¸ÂºÃ¥â€¡â€ 
//        ,'insertorderedlist':{
//             'decimal' : '' ,         //'1,2,3...'
//             'lower-alpha' : '' ,    // 'a,b,c...'
//             'lower-roman' : '' ,    //'i,ii,iii...'
//             'upper-alpha' : '' , lang   //'A,B,C'
//             'upper-roman' : ''      //'I,II,III...'
//        }

        //insertunorderedlist
        //Ã¦â€”Â Ã¥Âºï¿½Ã¥Ë†â€”Ã¨Â¡Â¨Ã§Å¡â€žÃ¤Â¸â€¹Ã¦â€¹â€°Ã©â€¦ï¿½Ã§Â½Â®Ã¯Â¼Å’Ã¥â‚¬Â¼Ã§â€¢â„¢Ã§Â©ÂºÃ¦â€”Â¶Ã¦â€�Â¯Ã¦Å’ï¿½Ã¥Â¤Å¡Ã¨Â¯Â­Ã¨Â¨â‚¬Ã¨â€¡ÂªÃ¥Å Â¨Ã¨Â¯â€ Ã¥Ë†Â«Ã¯Â¼Å’Ã¨â€¹Â¥Ã©â€¦ï¿½Ã§Â½Â®Ã¥â‚¬Â¼Ã¯Â¼Å’Ã¥Ë†â„¢Ã¤Â»Â¥Ã¦Â­Â¤Ã¥â‚¬Â¼Ã¤Â¸ÂºÃ¥â€¡â€ 
        //,insertunorderedlist : {
        //    'circle' : '',  // 'Ã¢â€”â€¹ Ã¥Â°ï¿½Ã¥Å“â€ Ã¥Å“Ë†'
        //    'disc' : '',    // 'Ã¢â€”ï¿½ Ã¥Â°ï¿½Ã¥Å“â€ Ã§â€šÂ¹'
        //    'square' : ''   //'Ã¢â€“Â  Ã¥Â°ï¿½Ã¦â€“Â¹Ã¥ï¿½â€”'
        //}

        //fontfamily
        //Ã¥Â­â€”Ã¤Â½â€œÃ¨Â®Â¾Ã§Â½Â® labelÃ§â€¢â„¢Ã§Â©ÂºÃ¦â€�Â¯Ã¦Å’ï¿½Ã¥Â¤Å¡Ã¨Â¯Â­Ã¨Â¨â‚¬Ã¨â€¡ÂªÃ¥Å Â¨Ã¥Ë†â€¡Ã¦ï¿½Â¢Ã¯Â¼Å’Ã¨â€¹Â¥Ã©â€¦ï¿½Ã§Â½Â®Ã¯Â¼Å’Ã¥Ë†â„¢Ã¤Â»Â¥Ã©â€¦ï¿½Ã§Â½Â®Ã¥â‚¬Â¼Ã¤Â¸ÂºÃ¥â€¡â€ 
//        ,'fontfamily':[
//            { label:'',name:'songti',val:'Ã¥Â®â€¹Ã¤Â½â€œ,SimSun'},
//            { label:'',name:'kaiti',val:'Ã¦Â¥Â·Ã¤Â½â€œ,Ã¦Â¥Â·Ã¤Â½â€œ_GB2312, SimKai'},
//            { label:'',name:'yahei',val:'Ã¥Â¾Â®Ã¨Â½Â¯Ã©â€ºâ€¦Ã©Â»â€˜,Microsoft YaHei'},
//            { label:'',name:'heiti',val:'Ã©Â»â€˜Ã¤Â½â€œ, SimHei'},
//            { label:'',name:'lishu',val:'Ã©Å¡Â¶Ã¤Â¹Â¦, SimLi'},
//            { label:'',name:'andaleMono',val:'andale mono'},
//            { label:'',name:'arial',val:'arial, helvetica,sans-serif'},
//            { label:'',name:'arialBlack',val:'arial black,avant garde'},
//            { label:'',name:'comicSansMs',val:'comic sans ms'},
//            { label:'',name:'impact',val:'impact,chicago'},
//            { label:'',name:'timesNewRoman',val:'times new roman'}
//          ]

        //fontsize
        //Ã¥Â­â€”Ã¥ï¿½Â·
        //,'fontsize':[10, 11, 12, 14, 16, 18, 20, 24, 36]

        //paragraph
        //Ã¦Â®ÂµÃ¨ï¿½Â½Ã¦Â Â¼Ã¥Â¼ï¿½ Ã¥â‚¬Â¼Ã§â€¢â„¢Ã§Â©ÂºÃ¦â€”Â¶Ã¦â€�Â¯Ã¦Å’ï¿½Ã¥Â¤Å¡Ã¨Â¯Â­Ã¨Â¨â‚¬Ã¨â€¡ÂªÃ¥Å Â¨Ã¨Â¯â€ Ã¥Ë†Â«Ã¯Â¼Å’Ã¨â€¹Â¥Ã©â€¦ï¿½Ã§Â½Â®Ã¯Â¼Å’Ã¥Ë†â„¢Ã¤Â»Â¥Ã©â€¦ï¿½Ã§Â½Â®Ã¥â‚¬Â¼Ã¤Â¸ÂºÃ¥â€¡â€ 
        //,'paragraph':{'p':'', 'h1':'', 'h2':'', 'h3':'', 'h4':'', 'h5':'', 'h6':''}

        //rowspacingtop
        //Ã¦Â®ÂµÃ©â€”Â´Ã¨Â·ï¿½ Ã¥â‚¬Â¼Ã¥â€™Å’Ã¦ËœÂ¾Ã§Â¤ÂºÃ§Å¡â€žÃ¥ï¿½ï¿½Ã¥Â­â€”Ã§â€ºÂ¸Ã¥ï¿½Å’
        //,'rowspacingtop':['5', '10', '15', '20', '25']

        //rowspacingBottom
        //Ã¦Â®ÂµÃ©â€”Â´Ã¨Â·ï¿½ Ã¥â‚¬Â¼Ã¥â€™Å’Ã¦ËœÂ¾Ã§Â¤ÂºÃ§Å¡â€žÃ¥ï¿½ï¿½Ã¥Â­â€”Ã§â€ºÂ¸Ã¥ï¿½Å’
        //,'rowspacingbottom':['5', '10', '15', '20', '25']

        //lineheight
        //Ã¨Â¡Å’Ã¥â€ â€¦Ã©â€”Â´Ã¨Â·ï¿½ Ã¥â‚¬Â¼Ã¥â€™Å’Ã¦ËœÂ¾Ã§Â¤ÂºÃ§Å¡â€žÃ¥ï¿½ï¿½Ã¥Â­â€”Ã§â€ºÂ¸Ã¥ï¿½Å’
        //,'lineheight':['1', '1.5','1.75','2', '3', '4', '5']

        //customstyle
        //Ã¨â€¡ÂªÃ¥Â®Å¡Ã¤Â¹â€°Ã¦Â Â·Ã¥Â¼ï¿½Ã¯Â¼Å’Ã¤Â¸ï¿½Ã¦â€�Â¯Ã¦Å’ï¿½Ã¥â€ºÂ½Ã©â„¢â€¦Ã¥Å’â€“Ã¯Â¼Å’Ã¦Â­Â¤Ã¥Â¤â€žÃ©â€¦ï¿½Ã§Â½Â®Ã¥â‚¬Â¼Ã¥ï¿½Â³Ã¥ï¿½Â¯Ã¦Å“â‚¬Ã¥ï¿½Å½Ã¦ËœÂ¾Ã§Â¤ÂºÃ¥â‚¬Â¼
        //blockÃ§Å¡â€žÃ¥â€¦Æ’Ã§Â´Â Ã¦ËœÂ¯Ã¤Â¾ï¿½Ã¦ï¿½Â®Ã¨Â®Â¾Ã§Â½Â®Ã¦Â®ÂµÃ¨ï¿½Â½Ã§Å¡â€žÃ©â‚¬Â»Ã¨Â¾â€˜Ã¨Â®Â¾Ã§Â½Â®Ã§Å¡â€žÃ¯Â¼Å’inlineÃ§Å¡â€žÃ¥â€¦Æ’Ã§Â´Â Ã¤Â¾ï¿½Ã¦ï¿½Â®BIUÃ§Å¡â€žÃ©â‚¬Â»Ã¨Â¾â€˜Ã¨Â®Â¾Ã§Â½Â®
        //Ã¥Â°Â½Ã©â€¡ï¿½Ã¤Â½Â¿Ã§â€�Â¨Ã¤Â¸â‚¬Ã¤Âºâ€ºÃ¥Â¸Â¸Ã§â€�Â¨Ã§Å¡â€žÃ¦Â â€¡Ã§Â­Â¾
        //Ã¥ï¿½â€šÃ¦â€¢Â°Ã¨Â¯Â´Ã¦ËœÅ½
        //tag Ã¤Â½Â¿Ã§â€�Â¨Ã§Å¡â€žÃ¦Â â€¡Ã§Â­Â¾Ã¥ï¿½ï¿½Ã¥Â­â€”
        //label Ã¦ËœÂ¾Ã§Â¤ÂºÃ§Å¡â€žÃ¥ï¿½ï¿½Ã¥Â­â€”Ã¤Â¹Å¸Ã¦ËœÂ¯Ã§â€�Â¨Ã¦ï¿½Â¥Ã¦Â â€¡Ã¨Â¯â€ Ã¤Â¸ï¿½Ã¥ï¿½Å’Ã§Â±Â»Ã¥Å¾â€¹Ã§Å¡â€žÃ¦Â â€¡Ã¨Â¯â€ Ã§Â¬Â¦Ã¯Â¼Å’Ã¦Â³Â¨Ã¦â€žï¿½Ã¨Â¿â„¢Ã¤Â¸ÂªÃ¥â‚¬Â¼Ã¦Â¯ï¿½Ã¤Â¸ÂªÃ¨Â¦ï¿½Ã¤Â¸ï¿½Ã¥ï¿½Å’Ã¯Â¼Å’
        //style Ã¦Â·Â»Ã¥Å Â Ã§Å¡â€žÃ¦Â Â·Ã¥Â¼ï¿½
        //Ã¦Â¯ï¿½Ã¤Â¸â‚¬Ã¤Â¸ÂªÃ¥Â¯Â¹Ã¨Â±Â¡Ã¥Â°Â±Ã¦ËœÂ¯Ã¤Â¸â‚¬Ã¤Â¸ÂªÃ¨â€¡ÂªÃ¥Â®Å¡Ã¤Â¹â€°Ã§Å¡â€žÃ¦Â Â·Ã¥Â¼ï¿½
        //,'customstyle':[
        //      {tag:'h1', name:'tc', label:'', style:'border-bottom:#ccc 2px solid;padding:0 4px 0 0;text-align:center;margin:0 0 20px 0;'},
        //      {tag:'h1', name:'tl',label:'', style:'border-bottom:#ccc 2px solid;padding:0 4px 0 0;margin:0 0 10px 0;'},
        //      {tag:'span',name:'im', label:'', style:'font-style:italic;font-weight:bold'},
        //      {tag:'span',name:'hi', label:'', style:'font-style:italic;font-weight:bold;color:rgb(51, 153, 204)'}
        //  ]

        //Ã¥ï¿½Â³Ã©â€�Â®Ã¨ï¿½Å“Ã¥ï¿½â€¢Ã§Å¡â€žÃ¥â€ â€¦Ã¥Â®Â¹Ã¯Â¼Å’Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¥ï¿½â€šÃ¨â‚¬Æ’plugins/contextmenu.jsÃ©â€¡Å’Ã¨Â¾Â¹Ã§Å¡â€žÃ©Â»ËœÃ¨Â®Â¤Ã¨ï¿½Å“Ã¥ï¿½â€¢Ã§Å¡â€žÃ¤Â¾â€¹Ã¥Â­ï¿½Ã¯Â¼Å’labelÃ§â€¢â„¢Ã§Â©ÂºÃ¦â€�Â¯Ã¦Å’ï¿½Ã¥â€ºÂ½Ã©â„¢â€¦Ã¥Å’â€“Ã¯Â¼Å’Ã¥ï¿½Â¦Ã¥Ë†â„¢Ã¤Â»Â¥Ã¦Â­Â¤Ã©â€¦ï¿½Ã§Â½Â®Ã¤Â¸ÂºÃ¥â€¡â€ 
//        ,contextMenu:[
//            {
//                label:'',       //Ã¦ËœÂ¾Ã§Â¤ÂºÃ§Å¡â€žÃ¥ï¿½ï¿½Ã§Â§Â°
//                cmdName:'selectall',//Ã¦â€°Â§Ã¨Â¡Å’Ã§Å¡â€žcommandÃ¥â€˜Â½Ã¤Â»Â¤Ã¯Â¼Å’Ã¥Â½â€œÃ§â€šÂ¹Ã¥â€¡Â»Ã¨Â¿â„¢Ã¤Â¸ÂªÃ¥ï¿½Â³Ã©â€�Â®Ã¨ï¿½Å“Ã¥ï¿½â€¢Ã¦â€”Â¶
//                //execÃ¥ï¿½Â¯Ã©â‚¬â€°Ã¯Â¼Å’Ã¦Å“â€°Ã¤Âºâ€ execÃ¥Â°Â±Ã¤Â¼Å¡Ã¥Å“Â¨Ã§â€šÂ¹Ã¥â€¡Â»Ã¦â€”Â¶Ã¦â€°Â§Ã¨Â¡Å’Ã¨Â¿â„¢Ã¤Â¸ÂªfunctionÃ¯Â¼Å’Ã¤Â¼ËœÃ¥â€¦Ë†Ã§ÂºÂ§Ã©Â«ËœÃ¤ÂºÅ½cmdName
//                exec:function () {
//                    //thisÃ¦ËœÂ¯Ã¥Â½â€œÃ¥â€°ï¿½Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã§Å¡â€žÃ¥Â®Å¾Ã¤Â¾â€¹
//                    //this.ui._dialogs['inserttableDialog'].open();
//                }
//            }
//           ]

        //wordCount
        //,wordCount:true          //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¥Â¼â‚¬Ã¥ï¿½Â¯Ã¥Â­â€”Ã¦â€¢Â°Ã§Â»Å¸Ã¨Â®Â¡
        //,maximumWords:10000       //Ã¥â€¦ï¿½Ã¨Â®Â¸Ã§Å¡â€žÃ¦Å“â‚¬Ã¥Â¤Â§Ã¥Â­â€”Ã§Â¬Â¦Ã¦â€¢Â°
        //Ã¥Â­â€”Ã¦â€¢Â°Ã§Â»Å¸Ã¨Â®Â¡Ã¦ï¿½ï¿½Ã§Â¤ÂºÃ¯Â¼Å’{#count}Ã¤Â»Â£Ã¨Â¡Â¨Ã¥Â½â€œÃ¥â€°ï¿½Ã¥Â­â€”Ã¦â€¢Â°Ã¯Â¼Å’{#leave}Ã¤Â»Â£Ã¨Â¡Â¨Ã¨Â¿ËœÃ¥ï¿½Â¯Ã¤Â»Â¥Ã¨Â¾â€œÃ¥â€¦Â¥Ã¥Â¤Å¡Ã¥Â°â€˜Ã¥Â­â€”Ã§Â¬Â¦Ã¦â€¢Â°,Ã§â€¢â„¢Ã§Â©ÂºÃ¦â€�Â¯Ã¦Å’ï¿½Ã¥Â¤Å¡Ã¨Â¯Â­Ã¨Â¨â‚¬Ã¨â€¡ÂªÃ¥Å Â¨Ã¥Ë†â€¡Ã¦ï¿½Â¢Ã¯Â¼Å’Ã¥ï¿½Â¦Ã¥Ë†â„¢Ã¦Å’â€°Ã¦Â­Â¤Ã©â€¦ï¿½Ã§Â½Â®Ã¦ËœÂ¾Ã§Â¤Âº
        //,wordCountMsg:''   //Ã¥Â½â€œÃ¥â€°ï¿½Ã¥Â·Â²Ã¨Â¾â€œÃ¥â€¦Â¥ {#count} Ã¤Â¸ÂªÃ¥Â­â€”Ã§Â¬Â¦Ã¯Â¼Å’Ã¦â€šÂ¨Ã¨Â¿ËœÃ¥ï¿½Â¯Ã¤Â»Â¥Ã¨Â¾â€œÃ¥â€¦Â¥{#leave} Ã¤Â¸ÂªÃ¥Â­â€”Ã§Â¬Â¦
        //Ã¨Â¶â€¦Ã¥â€¡ÂºÃ¥Â­â€”Ã¦â€¢Â°Ã©â„¢ï¿½Ã¥Ë†Â¶Ã¦ï¿½ï¿½Ã§Â¤Âº  Ã§â€¢â„¢Ã§Â©ÂºÃ¦â€�Â¯Ã¦Å’ï¿½Ã¥Â¤Å¡Ã¨Â¯Â­Ã¨Â¨â‚¬Ã¨â€¡ÂªÃ¥Å Â¨Ã¥Ë†â€¡Ã¦ï¿½Â¢Ã¯Â¼Å’Ã¥ï¿½Â¦Ã¥Ë†â„¢Ã¦Å’â€°Ã¦Â­Â¤Ã©â€¦ï¿½Ã§Â½Â®Ã¦ËœÂ¾Ã§Â¤Âº
        //,wordOverFlowMsg:''    //<span style="color:red;">Ã¤Â½Â Ã¨Â¾â€œÃ¥â€¦Â¥Ã§Å¡â€žÃ¥Â­â€”Ã§Â¬Â¦Ã¤Â¸ÂªÃ¦â€¢Â°Ã¥Â·Â²Ã§Â»ï¿½Ã¨Â¶â€¦Ã¥â€¡ÂºÃ¦Å“â‚¬Ã¥Â¤Â§Ã¥â€¦ï¿½Ã¨Â®Â¸Ã¥â‚¬Â¼Ã¯Â¼Å’Ã¦Å“ï¿½Ã¥Å Â¡Ã¥â„¢Â¨Ã¥ï¿½Â¯Ã¨Æ’Â½Ã¤Â¼Å¡Ã¦â€¹â€™Ã§Â»ï¿½Ã¤Â¿ï¿½Ã¥Â­ËœÃ¯Â¼ï¿½</span>

        //highlightcode
        // Ã¤Â»Â£Ã§Â ï¿½Ã©Â«ËœÃ¤ÂºÂ®Ã¦â€”Â¶Ã©Å“â‚¬Ã¨Â¦ï¿½Ã¥Å Â Ã¨Â½Â½Ã§Å¡â€žÃ§Â¬Â¬Ã¤Â¸â€°Ã¦â€“Â¹Ã¦ï¿½â€™Ã¤Â»Â¶Ã§Å¡â€žÃ¨Â·Â¯Ã¥Â¾â€ž
        // ,highlightJsUrl:URL + "third-party/SyntaxHighlighter/shCore.js"
        // ,highlightCssUrl:URL + "third-party/SyntaxHighlighter/shCoreDefault.css"

        //tab
        //Ã§â€šÂ¹Ã¥â€¡Â»tabÃ©â€�Â®Ã¦â€”Â¶Ã§Â§Â»Ã¥Å Â¨Ã§Å¡â€žÃ¨Â·ï¿½Ã§Â¦Â»,tabSizeÃ¥â‚¬ï¿½Ã¦â€¢Â°Ã¯Â¼Å’tabNodeÃ¤Â»â‚¬Ã¤Â¹Ë†Ã¥Â­â€”Ã§Â¬Â¦Ã¥ï¿½Å¡Ã¤Â¸ÂºÃ¥ï¿½â€¢Ã¤Â½ï¿½
        //,tabSize:4
        //,tabNode:'&nbsp;'

        //elementPathEnabled
        //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¥ï¿½Â¯Ã§â€�Â¨Ã¥â€¦Æ’Ã§Â´Â Ã¨Â·Â¯Ã¥Â¾â€žÃ¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯Ã¦ËœÂ¾Ã§Â¤Âº
        //,elementPathEnabled : true

        //removeFormat
        //Ã¦Â¸â€¦Ã©â„¢Â¤Ã¦Â Â¼Ã¥Â¼ï¿½Ã¦â€”Â¶Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¥Ë†Â Ã©â„¢Â¤Ã§Å¡â€žÃ¦Â â€¡Ã§Â­Â¾Ã¥â€™Å’Ã¥Â±Å¾Ã¦â‚¬Â§
        //removeForamtTagsÃ¦Â â€¡Ã§Â­Â¾
        //,removeFormatTags:'b,big,code,del,dfn,em,font,i,ins,kbd,q,samp,small,span,strike,strong,sub,sup,tt,u,var'
        //removeFormatAttributesÃ¥Â±Å¾Ã¦â‚¬Â§
        //,removeFormatAttributes:'class,style,lang,width,height,align,hspace,valign'

        //undo
        //Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¦Å“â‚¬Ã¥Â¤Å¡Ã¥â€ºÅ¾Ã©â‚¬â‚¬Ã§Å¡â€žÃ¦Â¬Â¡Ã¦â€¢Â°,Ã©Â»ËœÃ¨Â®Â¤20
        //,maxUndoCount:20
        //Ã¥Â½â€œÃ¨Â¾â€œÃ¥â€¦Â¥Ã§Å¡â€žÃ¥Â­â€”Ã§Â¬Â¦Ã¦â€¢Â°Ã¨Â¶â€¦Ã¨Â¿â€¡Ã¨Â¯Â¥Ã¥â‚¬Â¼Ã¦â€”Â¶Ã¯Â¼Å’Ã¤Â¿ï¿½Ã¥Â­ËœÃ¤Â¸â‚¬Ã¦Â¬Â¡Ã§Å½Â°Ã¥Å“Âº
        //,maxInputCount:1

        //autoHeightEnabled
        // Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¨â€¡ÂªÃ¥Å Â¨Ã©â€¢Â¿Ã©Â«Ëœ,Ã©Â»ËœÃ¨Â®Â¤true
        //,autoHeightEnabled:true

        //scaleEnabled
        //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¦â€¹â€°Ã¤Â¼Â¸Ã©â€¢Â¿Ã©Â«Ëœ,Ã©Â»ËœÃ¨Â®Â¤true(Ã¥Â½â€œÃ¥Â¼â‚¬Ã¥ï¿½Â¯Ã¦â€”Â¶Ã¯Â¼Å’Ã¨â€¡ÂªÃ¥Å Â¨Ã©â€¢Â¿Ã©Â«ËœÃ¥Â¤Â±Ã¦â€¢Ë†)
        //,scaleEnabled:false
        //,minFrameWidth:800    //Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¦â€¹â€“Ã¥Å Â¨Ã¦â€”Â¶Ã¦Å“â‚¬Ã¥Â°ï¿½Ã¥Â®Â½Ã¥ÂºÂ¦,Ã©Â»ËœÃ¨Â®Â¤800
        //,minFrameHeight:220  //Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¦â€¹â€“Ã¥Å Â¨Ã¦â€”Â¶Ã¦Å“â‚¬Ã¥Â°ï¿½Ã©Â«ËœÃ¥ÂºÂ¦,Ã©Â»ËœÃ¨Â®Â¤220

        //autoFloatEnabled
        //Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¤Â¿ï¿½Ã¦Å’ï¿½toolbarÃ§Å¡â€žÃ¤Â½ï¿½Ã§Â½Â®Ã¤Â¸ï¿½Ã¥Å Â¨,Ã©Â»ËœÃ¨Â®Â¤true
        //,autoFloatEnabled:true
        //Ã¦ÂµÂ®Ã¥Å Â¨Ã¦â€”Â¶Ã¥Â·Â¥Ã¥â€¦Â·Ã¦Â ï¿½Ã¨Â·ï¿½Ã§Â¦Â»Ã¦Âµï¿½Ã¨Â§Ë†Ã¥â„¢Â¨Ã©Â¡Â¶Ã©Æ’Â¨Ã§Å¡â€žÃ©Â«ËœÃ¥ÂºÂ¦Ã¯Â¼Å’Ã§â€�Â¨Ã¤ÂºÅ½Ã¦Å¸ï¿½Ã¤Âºâ€ºÃ¥â€¦Â·Ã¦Å“â€°Ã¥â€ºÂºÃ¥Â®Å¡Ã¥Â¤Â´Ã©Æ’Â¨Ã§Å¡â€žÃ©Â¡ÂµÃ©ï¿½Â¢
        //,topOffset:30

        //indentValue
        //Ã©Â¦â€“Ã¨Â¡Å’Ã§Â¼Â©Ã¨Â¿â€ºÃ¨Â·ï¿½Ã§Â¦Â»,Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯2em
        //,indentValue:'2em'

        //pageBreakTag
        //Ã¥Ë†â€ Ã©Â¡ÂµÃ¦Â â€¡Ã¨Â¯â€ Ã§Â¬Â¦,Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯_baidu_page_break_tag_
        //,pageBreakTag:'_baidu_page_break_tag_'

        //sourceEditor
        //Ã¦Âºï¿½Ã§Â ï¿½Ã§Å¡â€žÃ¦Å¸Â¥Ã§Å“â€¹Ã¦â€“Â¹Ã¥Â¼ï¿½,codemirror Ã¦ËœÂ¯Ã¤Â»Â£Ã§Â ï¿½Ã©Â«ËœÃ¤ÂºÂ®Ã¯Â¼Å’textareaÃ¦ËœÂ¯Ã¦â€“â€¡Ã¦Å“Â¬Ã¦Â¡â€ ,Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯codemirror
        //Ã¦Â³Â¨Ã¦â€žï¿½Ã©Â»ËœÃ¨Â®Â¤codemirrorÃ¥ï¿½ÂªÃ¨Æ’Â½Ã¥Å“Â¨ie8+Ã¥â€™Å’Ã©ï¿½Å¾ieÃ¤Â¸Â­Ã¤Â½Â¿Ã§â€�Â¨
        //,sourceEditor:"codemirror"
        //Ã¥Â¦â€šÃ¦Å¾Å“sourceEditorÃ¦ËœÂ¯codemirrorÃ¯Â¼Å’Ã¨Â¿ËœÃ§â€�Â¨Ã©â€¦ï¿½Ã§Â½Â®Ã¤Â¸â‚¬Ã¤Â¸â€¹Ã¤Â¸Â¤Ã¤Â¸ÂªÃ¥ï¿½â€šÃ¦â€¢Â°
        //codeMirrorJsUrl jsÃ¥Å Â Ã¨Â½Â½Ã§Å¡â€žÃ¨Â·Â¯Ã¥Â¾â€žÃ¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯ URL + "third-party/codemirror/codemirror.js"
        //,codeMirrorJsUrl:URL + "third-party/codemirror/codemirror.js"
        //codeMirrorCssUrl cssÃ¥Å Â Ã¨Â½Â½Ã§Å¡â€žÃ¨Â·Â¯Ã¥Â¾â€žÃ¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯ URL + "third-party/codemirror/codemirror.css"
        //,codeMirrorCssUrl:URL + "third-party/codemirror/codemirror.css"
        //Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¥Ë†ï¿½Ã¥Â§â€¹Ã¥Å’â€“Ã¥Â®Å’Ã¦Ë†ï¿½Ã¥ï¿½Å½Ã¦ËœÂ¯Ã¥ï¿½Â¦Ã¨Â¿â€ºÃ¥â€¦Â¥Ã¦Âºï¿½Ã§Â ï¿½Ã¦Â¨Â¡Ã¥Â¼ï¿½Ã¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¤Â¸ÂºÃ¥ï¿½Â¦Ã£â‚¬â€š
        //,sourceEditorFirst:false

        //serialize
        // Ã©â€¦ï¿½Ã§Â½Â®Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã§Å¡â€žÃ¨Â¿â€¡Ã¦Â»Â¤Ã¨Â§â€žÃ¥Ë†â„¢
        // serializeÃ¦ËœÂ¯Ã¤Â¸Âªobject,Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¦Å“â€°Ã¥Â±Å¾Ã¦â‚¬Â§blackListÃ¯Â¼Å’whiteListÃ¥Â±Å¾Ã¦â‚¬Â§Ã¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤Ã¦ËœÂ¯{}
        // Ã¤Â¾â€¹Ã¥Â­ï¿½:
//        , serialize : {
//              //Ã©Â»â€˜Ã¥ï¿½ï¿½Ã¥ï¿½â€¢Ã¯Â¼Å’Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã¤Â¼Å¡Ã¨Â¿â€¡Ã¦Â»Â¤Ã¦Å½â€°Ã¤Â¸â‚¬Ã¤Â¸â€¹Ã¦Â â€¡Ã§Â­Â¾
//              blackList:{object:1, applet:1, input:1, meta:1, base:1, button:1, select:1, textarea:1, '#comment':1, 'map':1, 'area':1}
//        }


        //autotypeset
        //  //Ã¨â€¡ÂªÃ¥Å Â¨Ã¦Å½â€™Ã§â€°Ë†Ã¥ï¿½â€šÃ¦â€¢Â°
        //  ,autotypeset:{
        //      mergeEmptyline : true,         //Ã¥ï¿½Ë†Ã¥Â¹Â¶Ã§Â©ÂºÃ¨Â¡Å’
        //      removeClass : true,           //Ã¥Å½Â»Ã¦Å½â€°Ã¥â€ â€”Ã¤Â½â„¢Ã§Å¡â€žclass
        //      removeEmptyline : false,      //Ã¥Å½Â»Ã¦Å½â€°Ã§Â©ÂºÃ¨Â¡Å’
        //      textAlign : "left" ,           //Ã¦Â®ÂµÃ¨ï¿½Â½Ã§Å¡â€žÃ¦Å½â€™Ã§â€°Ë†Ã¦â€“Â¹Ã¥Â¼ï¿½Ã¯Â¼Å’Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¦ËœÂ¯ left,right,center,justify Ã¥Å½Â»Ã¦Å½â€°Ã¨Â¿â„¢Ã¤Â¸ÂªÃ¥Â±Å¾Ã¦â‚¬Â§Ã¨Â¡Â¨Ã§Â¤ÂºÃ¤Â¸ï¿½Ã¦â€°Â§Ã¨Â¡Å’Ã¦Å½â€™Ã§â€°Ë†
        //      imageBlockLine : 'center',      //Ã¥â€ºÂ¾Ã§â€°â€¡Ã§Å¡â€žÃ¦ÂµÂ®Ã¥Å Â¨Ã¦â€“Â¹Ã¥Â¼ï¿½Ã¯Â¼Å’Ã§â€¹Â¬Ã¥ï¿½Â Ã¤Â¸â‚¬Ã¨Â¡Å’Ã¥â€°Â§Ã¤Â¸Â­,Ã¥Â·Â¦Ã¥ï¿½Â³Ã¦ÂµÂ®Ã¥Å Â¨Ã¯Â¼Å’Ã©Â»ËœÃ¨Â®Â¤: center,left,right,none Ã¥Å½Â»Ã¦Å½â€°Ã¨Â¿â„¢Ã¤Â¸ÂªÃ¥Â±Å¾Ã¦â‚¬Â§Ã¨Â¡Â¨Ã§Â¤ÂºÃ¤Â¸ï¿½Ã¦â€°Â§Ã¨Â¡Å’Ã¦Å½â€™Ã§â€°Ë†
        //      pasteFilter : false,            //Ã¦Â Â¹Ã¦ï¿½Â®Ã¨Â§â€žÃ¥Ë†â„¢Ã¨Â¿â€¡Ã¦Â»Â¤Ã¦Â²Â¡Ã¤Âºâ€¹Ã§Â²ËœÃ¨Â´Â´Ã¨Â¿â€ºÃ¦ï¿½Â¥Ã§Å¡â€žÃ¥â€ â€¦Ã¥Â®Â¹
        //      clearFontSize : false,          //Ã¥Å½Â»Ã¦Å½â€°Ã¦â€°â‚¬Ã¦Å“â€°Ã§Å¡â€žÃ¥â€ â€¦Ã¥ÂµÅ’Ã¥Â­â€”Ã¥ï¿½Â·Ã¯Â¼Å’Ã¤Â½Â¿Ã§â€�Â¨Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã©Â»ËœÃ¨Â®Â¤Ã§Å¡â€žÃ¥Â­â€”Ã¥ï¿½Â·
        //      clearFontFamily : false,        //Ã¥Å½Â»Ã¦Å½â€°Ã¦â€°â‚¬Ã¦Å“â€°Ã§Å¡â€žÃ¥â€ â€¦Ã¥ÂµÅ’Ã¥Â­â€”Ã¤Â½â€œÃ¯Â¼Å’Ã¤Â½Â¿Ã§â€�Â¨Ã§Â¼â€“Ã¨Â¾â€˜Ã¥â„¢Â¨Ã©Â»ËœÃ¨Â®Â¤Ã§Å¡â€žÃ¥Â­â€”Ã¤Â½â€œ
        //      removeEmptyNode : false ,       // Ã¥Å½Â»Ã¦Å½â€°Ã§Â©ÂºÃ¨Å â€šÃ§â€šÂ¹
        //      //Ã¥ï¿½Â¯Ã¤Â»Â¥Ã¥Å½Â»Ã¦Å½â€°Ã§Å¡â€žÃ¦Â â€¡Ã§Â­Â¾
        //      removeTagNames : {Ã¦Â â€¡Ã§Â­Â¾Ã¥ï¿½ï¿½Ã¥Â­â€”:1},
        //      indent : false,                 // Ã¨Â¡Å’Ã©Â¦â€“Ã§Â¼Â©Ã¨Â¿â€º
        //      indentValue : '2em'             //Ã¨Â¡Å’Ã©Â¦â€“Ã§Â¼Â©Ã¨Â¿â€ºÃ§Å¡â€žÃ¥Â¤Â§Ã¥Â°ï¿½
        //  }
    };
})();
